# Basic Python

## 1.Split this string

In [1]:
s="Hi there Sam!"
string=s.split()
print(string)

['Hi', 'there', 'Sam!']

## 2.Use .format() to print the following string

In [2]:
txt1="The diameter of {0} is {1}".format("Earth",12742)
print(txt1)

The diameter of Earth is 12742

## 3.In this nest dictionary grab the word "hello"

In [14]:
d={'k1':[1,2,3,{'tricky':['oh','man','inception',{'target':[1,2,3,'hello']}]}]}
print(d['k1'][3]['tricky'][3]['target'][3])

hello

## 4.1 Create an array of 10 zeros

In [3]:
import numpy as np

In [4]:
a=np.array([0,0,0,0,0,0,0,0,0,0])
a

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

## 4.2 Create an array of 10 fives

In [5]:
b=np.array([5,5,5,5,5,5,5,5,5,5])
b

array([5, 5, 5, 5, 5, 5, 5, 5, 5, 5])

## 5.Create an array of all the even integers from 20 to 35

In [6]:
array=np.arange(20,36,2)
print("Array of all the even integers from 20 to 35:")
print(array)

Array of all the even integers from 20 to 35:
[20 22 24 26 28 30 32 34]

## 6.Create a 3*3 matrix with values ranging from 0 to 8

In [7]:
x=np.arange(0,9).reshape(3,3)
print(x)

[[0 1 2]
 [3 4 5]
 [6 7 8]]

## 7.Concatinate a and b

In [8]:
a=np.array([1,2,3])
b=np.array([4,5,6])
c=np.concatenate((a,b))
print(c)

[1 2 3 4 5 6]

## Pandas

## 8.Create a dataframe with 3 rows and 2 columns

In [9]:
import pandas as pd

In [10]:
pd.DataFrame(index=np.arange(3),columns=np.arange(2))

     0    1
0  NaN  NaN
1  NaN  NaN
2  NaN  NaN

## 9.Generate the series of dates from 1st Jan 2023 to 10th Feb 2023

In [11]:
import datetime

In [12]:
from datetime import date
start_date=date(2023,1,1)
end_date=date(2023,2,11)
[date.fromordinal(i) for i in range(start_date.toordinal(),end_date.toordinal())]

[datetime.date(2023, 1, 1),
 datetime.date(2023, 1, 2),
 datetime.date(2023, 1, 3),
 datetime.date(2023, 1, 4),
 datetime.date(2023, 1, 5),
 datetime.date(2023, 1, 6),
 datetime.date(2023, 1, 7),
 datetime.date(2023, 1, 8),
 datetime.date(2023, 1, 9),
 datetime.date(2023, 1, 10),
 datetime.date(2023, 1, 11),
 datetime.date(2023, 1, 12),
 datetime.date(2023, 1, 13),
 datetime.date(2023, 1, 14),
 datetime.date(2023, 1, 15),
 datetime.date(2023, 1, 16),
 datetime.date(2023, 1, 17),
 datetime.date(2023, 1, 18),
 datetime.date(2023, 1, 19),
 datetime.date(2023, 1, 20),
 datetime.date(2023, 1, 21),
 datetime.date(2023, 1, 22),
 datetime.date(2023, 1, 23),
 datetime.date(2023, 1, 24),
 datetime.date(2023, 1, 25),
 datetime.date(2023, 1, 26),
 datetime.date(2023, 1, 27),
 datetime.date(2023, 1, 28),
 datetime.date(2023, 1, 29),
 datetime.date(2023, 1, 30),
 datetime.date(2023, 1, 31),
 datetime.date(2023, 2, 1),
 datetime.date(2023, 2, 2),
 datetime.date(2023, 2, 3),
 datetime.date(2023, 2, 4),
 datetime.date(2023, 2, 5),
 datetime.date(2023, 2, 6),
 datetime.date(2023, 2, 7),
 datetime.date(2023, 2, 8),
 datetime.date(2023, 2, 9),
 datetime.date(2023, 2, 10)]

## 10.Create 2D list to DataFrame

In [13]:
pd.DataFrame([[1,'aaa',22],[2,'bbb',25],[3,'ccc',24]])

   0    1   2
0  1  aaa  22
1  2  bbb  25
2  3  ccc  24